In [2]:
import pandas as pd
import numpy as np
#Create Dummy Data (dummy = kukla
stuff = {"A":[1,2,3], "B":[4,np.nan,6],"C":[7,8,9],"D":[10,11,12]}
my_df = pd.DataFrame(stuff)
my_df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

In [3]:
# Drop rows with null data
my_df.dropna()

   A    B  C   D
0  1  4.0  7  10
2  3  6.0  9  12

In [6]:
# Drop columns with null data
my_df.dropna(axis=1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [7]:
stuff = {"A":[1,2,3], "B":[4,np.nan,np.nan],"C":[7,8,9],"D":[10,11,12]}
my_df = pd.DataFrame(stuff)
my_df
# Added 1 more NaN

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  NaN  9  12

In [13]:
# More than one? Set Threshold
my_df.dropna(thresh=2,axis=1)
# thresh = 2 because there is 2 NaN value

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [18]:
# Replace thins with fillna()
my_df.fillna(value = "Bob")

   A    B  C   D
0  1  4.0  7  10
1  2  Bob  8  11
2  3  Bob  9  12

In [21]:
stuff = {"A":[1,2,3], "B":[4,np.nan,6],"C":[7,8,9],"D":[10,11,12]}
my_df = pd.DataFrame(stuff)

# Use Math Functions
my_df.fillna(value = my_df["B"].mean())

   A    B  C   D
0  1  4.0  7  10
1  2  5.0  8  11
2  3  6.0  9  12

In [24]:
# Use min max
my_df.fillna(value = my_df["B"].min())

   A    B  C   D
0  1  4.0  7  10
1  2  4.0  8  11
2  3  6.0  9  12

In [25]:
my_df.fillna(value = my_df["B"].sum())

   A     B  C   D
0  1   4.0  7  10
1  2  10.0  8  11
2  3   6.0  9  12